zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
/***************************************************************************//**
* \file cy_capsense_structure.h
* \version 10.0.0
*
* \brief
* This file provides the top-level declarations of the CAPSENSE&trade; data
* structure. Also, the file declares the functions for data access.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#if !defined(CY_CAPSENSE_STRUCTURE_H)
#define CY_CAPSENSE_STRUCTURE_H

#include "cy_syslib.h"
#include "cy_device_headers.h"
#include "cycfg_capsense_defines.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_gesture_lib.h"
#include "cy_capsense_common.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_csd.h"
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_msclp.h"
#else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
    #include "cy_msc.h"
#endif /* CY_CAPSENSE_PLATFORM_BLOCK selection */

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP))
#if defined(__cplusplus)
extern "C" {
#endif /* defined(__cplusplus) */

/*******************************************************************************
* CAPSENSE&trade; Enumerated Types
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_enums *//** \{ */
/******************************************************************************/

/** Defines MW Tuner module states */
typedef enum
{
    CY_CAPSENSE_TU_FSM_RUNNING          = 0x00u,                /**< Running state is a state when CAPSENSE&trade; middleware is not
                                                                   * blocked by the CAPSENSE&trade; Tuner tool and application program continuously scans */
    CY_CAPSENSE_TU_FSM_SUSPENDED        = 0x01u,                /**< Scanning is suspended */
    CY_CAPSENSE_TU_FSM_ONE_SCAN         = 0x03u,                /**< Scanning is suspended after one scan cycle */
} cy_en_capsense_tuner_state_t;

/** Defines the Tuner command codes */
typedef enum
{
    CY_CAPSENSE_TU_CMD_NONE_E                    = 0u,          /**< No command */
    CY_CAPSENSE_TU_CMD_SUSPEND_E                 = 1u,          /**< Suspend command */
    CY_CAPSENSE_TU_CMD_RESUME_E                  = 2u,          /**< Resume command switches state from suspend to running */
    CY_CAPSENSE_TU_CMD_RESTART_E                 = 3u,          /**< Restart command requests to perform CAPSENSE&trade; re-initialization and switches state to running */
    CY_CAPSENSE_TU_CMD_RUN_SNR_TEST_E            = 4u,          /**< Reserved */
    CY_CAPSENSE_TU_CMD_PING_E                    = 5u,          /**< Ping command to check whether application program calls Cy_CapSense_RunTuner() */
    CY_CAPSENSE_TU_CMD_ONE_SCAN_E                = 6u,          /**< Execute one scan cycle and then switch to suspend state */
    CY_CAPSENSE_TU_CMD_WRITE_E                   = 7u,          /**< Writes specified data with offset into cy_capsense_tuner */
    CY_CAPSENSE_TU_CMD_COMM_DIS_E                = 8u,          /**< Disables the communication mode (used in the fifth-generation low power CAPSENSE&trade; only):
                                                                 * * Low power sensors rawcounts does not copied to communication structure
                                                                 * * Communication of CapSense data structure to Tuner does not happen (in case of UART or protocol-agnostic method) */
    CY_CAPSENSE_TU_CMD_COMM_EN_E                 = 9u,                   /**< Enables the communication mode (used in the fifth-generation low power CAPSENSE&trade; only):
                                                                 * * Low power sensors rawcounts are copied to communication structure
                                                                 * * Data is transferred to Tuner (in case of UART or protocol-agnostic method) */
    CY_CAPSENSE_TU_CMD_RESTART_ONLY_E            = 10u,         /**< Restart command requests to perform CAPSENSE&trade; re-initialization and keeps state unchanged */
    CY_CAPSENSE_TU_CMD_SET_DUTY_CYCLE_AND_SCAN_E = 11u,         /**< Sets duty cycle and executes one scan (used for Foam Detection LLW only) */
    CY_CAPSENSE_TU_CMD_CALIBRATE_WIDGET_BLOCKING_E = 12u,       /**< Calibrates a desired widget */
    CY_CAPSENSE_TU_CMD_SCAN_WIDGET_BLOCKING_E    = 13u,         /**< Scans a desired widget and waits till scan complete */
    CY_CAPSENSE_TU_CMD_BIST_UPDATE_WIDGET_CRC_E  = 14u,         /**< Updates a desired widget CRC if built-in self-test is enabled */
    CY_CAPSENSE_TU_CMD_APPLY_CDACS_WIDGET_E      = 15u,         /**< Takes CDAC values from data structure and applies them to sensor frame structure */
    CY_CAPSENSE_TU_CMD_LAST_E                    = 16u,         /**< The last command */
} cy_en_capsense_tuner_cmd_t;

/** Defines widget types */
typedef enum
{
    CY_CAPSENSE_WD_BUTTON_E             = 0x01u,                /**< Button widget */
    CY_CAPSENSE_WD_LINEAR_SLIDER_E      = 0x02u,                /**< Linear Slider widget */
    CY_CAPSENSE_WD_RADIAL_SLIDER_E      = 0x03u,                /**< Radial Slider widget */
    CY_CAPSENSE_WD_MATRIX_BUTTON_E      = 0x04u,                /**< Matrix Buttons widget */
    CY_CAPSENSE_WD_TOUCHPAD_E           = 0x05u,                /**< Touchpad widget */
    CY_CAPSENSE_WD_PROXIMITY_E          = 0x06u,                /**< Proximity widget */
    CY_CAPSENSE_WD_LOW_POWER_E          = 0x07u,                /**< Low Power widget, used in the fifth-generation low power CAPSENSE&trade; only */
    CY_CAPSENSE_WD_LIQUID_LEVEL_E       = 0x08u,                /**< Liquid level widget, used in the fifth-generation low power CAPSENSE&trade; only */
    CY_CAPSENSE_WD_LIQUID_PRESENCE_E    = 0x09u,                /**< Liquid presence widget, used in the fifth-generation low power CAPSENSE&trade; only */
    CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E  = 0x0Au,                /**< Wheatstone bridge widget, used in the fifth-generation low power CAPSENSE&trade; only */
} cy_en_capsense_widget_type_t;

/** Defines CAPSENSE&trade; return statuses types */
typedef enum
{
    CY_CAPSENSE_SUCCESS_E               = 0x00u,                /**< The success return status */
    CY_CAPSENSE_BAD_PARAM_E             = 0x01u,                /**< One or more invalid input parameters  */
    CY_CAPSENSE_HW_LOCKED_E             = 0x02u,                /**< The sensing HW block is captured by another middleware */
    CY_CAPSENSE_HW_BUSY_E               = 0x03u,                /**< The sensing HW block is busy by previous operation */
    CY_CAPSENSE_TIMEOUT_E               = 0x04u,                /**< The sensing HW block operation was not finished correctly */
} cy_en_capsense_return_status_t;

/** Defines types of electrode */
typedef enum
{
    CY_CAPSENSE_ELTD_TYPE_SELF_E        = 0x01u,                /**< Electrode used as a sensor in CSD sensing method */
    CY_CAPSENSE_ELTD_TYPE_MUT_TX_E      = 0x02u,                /**< Electrode used as a TX in CSX sensing method */
    CY_CAPSENSE_ELTD_TYPE_MUT_RX_E      = 0x03u,                /**< Electrode used as a RX in CSX sensing method */
} cy_en_capsense_eltd_t;


/** Defines connections of sensing capacitors */
typedef enum
{
    CY_CAPSENSE_CMODPAD_E               = 0x01u,                /**< External capacitor is connected to dedicated CMOD pad */
    CY_CAPSENSE_CTANKPAD_E              = 0x02u,                /**< External capacitor is connected to dedicated CSH pad */
    CY_CAPSENSE_CSHIELDPAD_E            = 0x03u,                /**< External capacitor is connected to dedicated SHIELD pad */
    CY_CAPSENSE_VREFEXTPAD_E            = 0x04u,                /**< External capacitor is connected to dedicated VREF pad */
} cy_en_capsense_cap_connection_t;


