zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
/** Defines CAPSENSE&trade; middleware execution events
  * when the CAPSENSE&trade; callback can be executed. */
typedef enum
{
    CY_CAPSENSE_START_SAMPLE_E          = 0x01u,                /**< Start Sample Callback. The callback will be executed before each sensor
                                                                   *scan triggering */
    CY_CAPSENSE_END_OF_SCAN_E           = 0x02u,                /**< End Of Scan Callback. The callback will be executed when sensor scan
                                                                   * is finished and there is no other sensors in the queue to be scanned. */
} cy_en_capsense_callback_event_t;


/** Defines HW configurations types for BIST operations */
typedef enum
{
    CY_CAPSENSE_BIST_HW_UNDEFINED_E     = 0x00u,                /**< Initialization or releasing of the CAPSENSE&trade; HW block */
    CY_CAPSENSE_BIST_HW_SHORT_E         = 0x01u,                /**< Short tests */
    CY_CAPSENSE_BIST_HW_ELTD_CAP_E      = 0x02u,                /**< Sensor and shield electrodes capacitance measurements with disabled shield */
    CY_CAPSENSE_BIST_HW_EXTERNAL_CAP_E  = 0x03u,                /**< External capacitors capacitance measurements */
    CY_CAPSENSE_BIST_HW_VDDA_E          = 0x04u,                /**< VDDA measurement */
    CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E   = 0x05u,                /**< Sensor electrodes capacitance measurements with configured shield */
} cy_en_capsense_bist_hw_config_t;


/** Defines BIST IO Configuration */
typedef enum
{
    CY_CAPSENSE_BIST_IO_UNDEFINED_E        = 0x00u,             /**< The undefined state. Pins are disconnected from AMuxBus */
    CY_CAPSENSE_BIST_IO_STRONG_E           = 0x01u,             /**< The drive mode is set to Strong in off - Low.
                                                                   * The HSIOM is set to GPIO */
    CY_CAPSENSE_BIST_IO_HIGHZA_E           = 0x02u,             /**< The drive mode is set to High-Z.
                                                                   * The HSIOM is set to GPIO */
    CY_CAPSENSE_BIST_IO_SENSE_E            = 0x03u,             /**< The drive mode is set to High-Z/Strong in off (depending on the device platform).
                                                                   * The HSIOM is set to CSD sense connection. */
    CY_CAPSENSE_BIST_IO_SHIELD_E           = 0x04u,             /**< The drive mode is set to High-Z/Strong in off (depending on the device platform).
                                                                   * The HSIOM is set to CSD shield connection. */
    CY_CAPSENSE_BIST_IO_STRONG_HIGH_E      = 0x05u,             /**< The drive mode is set to Strong in off - High.
                                                                   * The HSIOM is set to GPIO */
    CY_CAPSENSE_BIST_IO_VDDA2_E            = 0x06u,             /**< The drive mode is set to High-Z/Strong in off.
                                                                   * The HSIOM is set to VDDA/2 */
} cy_en_capsense_bist_io_state_t;


/** Defines BIST result statuses */
typedef enum
{
    CY_CAPSENSE_BIST_SUCCESS_E             = 0x00u,             /**< The success test status */
    CY_CAPSENSE_BIST_BAD_PARAM_E           = 0x01u,             /**< The bad input parameters test status */
    CY_CAPSENSE_BIST_HW_BUSY_E             = 0x02u,             /**< The CAPSENSE&trade; HW block is busy by previous operation */
    CY_CAPSENSE_BIST_LOW_LIMIT_E           = 0x03u,             /**< The status for a low limit reached during the test */
    CY_CAPSENSE_BIST_HIGH_LIMIT_E          = 0x04u,             /**< The status for a high limit reached during the test */
    CY_CAPSENSE_BIST_ERROR_E               = 0x05u,             /**< The status for an error occurred during the test.
                                                                     The test is not completed */
    CY_CAPSENSE_BIST_FEATURE_DISABLED_E    = 0x06u,             /**< The BIST feature is disabled. */
    CY_CAPSENSE_BIST_TIMEOUT_E             = 0x07u,             /**< The status for a timeout occurred during the test */
    CY_CAPSENSE_BIST_BAD_CONFIG_E          = 0x08u,             /**< The bad configuration parameters test status */
    CY_CAPSENSE_BIST_FAIL_E                = 0x0Fu,             /**< The failed test status */
} cy_en_capsense_bist_status_t;

#if ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/** Defines IDs of the external capacitors */
typedef enum
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        CY_CAPSENSE_BIST_CMOD01_ID_E         = 0x00u,                /**< ID for the MSC0 Cmod1 external capacitor \note This value is available for the fifth-generation low power CAPSENSE&trade;.*/
        CY_CAPSENSE_BIST_CMOD02_ID_E         = 0x01u,                /**< ID for the MSC0 Cmod2 external capacitor \note This value is available for the fifth-generation low power CAPSENSE&trade;.*/
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        CY_CAPSENSE_BIST_CMOD_ID_E           = 0x00u,                /**< ID for Cmod external capacitor \note This value is available only for the fourth-generation CAPSENSE&trade;.*/
        CY_CAPSENSE_BIST_CINTA_ID_E          = 0x01u,                /**< ID for CintA external capacitor \note This value is available only for the fourth-generation CAPSENSE&trade;.*/
        CY_CAPSENSE_BIST_CINTB_ID_E          = 0x02u,                /**< ID for CintB external capacitor \note This value is available only for the fourth-generation CAPSENSE&trade;.*/
        CY_CAPSENSE_BIST_CSH_ID_E            = 0x03u,                /**< ID for Csh external capacitor \note This value is available only for the fourth-generation CAPSENSE&trade;.*/
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
} cy_en_capsense_bist_external_cap_id_t;
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

/** Defines the raw count accumulation mode for MSC HW block */
typedef enum
{
    CY_CAPSENSE_MSC_RAW_SATURATE_E         = 0x00u,             /**< In this scenario, RAW_COUNT is clamped at 0xFFFF and RESULT_FIFO_RD.OVERFLOW is set. */
    CY_CAPSENSE_MSC_RAW_OVERFLOW_E         = 0x01u,             /**< In this scenario, RAW_COUNT rolls over and RESULT_FIFO_RD.OVERFLOW is set. This mode allows more sensitive tuning if measuring baseline capacitance */
} cy_en_capsense_msc_raw_mode_t;

