zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
/** \} */


/*******************************************************************************
* CAPSENSE&trade; Data Structures
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_structures *//** \{ */
/******************************************************************************/

/** Unified return status of CAPSENSE&trade; operation:
 * * CY_CAPSENSE_STATUS_SUCCESS
 * * CY_CAPSENSE_STATUS_BAD_PARAM
 * * CY_CAPSENSE_STATUS_BAD_DATA
 * * CY_CAPSENSE_STATUS_TIMEOUT
 * * CY_CAPSENSE_STATUS_INVALID_STATE
 * * CY_CAPSENSE_STATUS_BAD_CONFIG
 * * CY_CAPSENSE_STATUS_CONFIG_OVERFLOW
 * * CY_CAPSENSE_STATUS_HW_BUSY
 */
typedef uint32_t cy_capsense_status_t;

/** Unified return state of CAPSENSE&trade; Middleware:
 *
 * * CY_CAPSENSE_MW_STATE_BIST_MASK               - The BIST is in progress.
 *                                                  The next scan frame cannot be started.
 * * CY_CAPSENSE_MW_STATE_CALIBRATION_MASK        - The auto-calibration is in progress.
 *                                                  The next scan frame cannot be started.
 * * CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK         - The smart sensing algorithm is
 *                                                  in progress.
 *                                                  The next scan frame cannot be started.
 * * CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK     - Middleware initialization is
 *                                                  in progress and a next scan frame
 *                                                  can be initiated.
 * * CY_CAPSENSE_MW_STATE_SCAN_SLOT_MASK[x]       - The set [x] number of the result
 *                                                  means that the previously initiated
 *                                                  scan for the [x] slot is completed
 *                                                  or in progress. In CS-DMA mode, this
 *                                                  field is set only for the first
 *                                                  scanned slot.
 */
typedef uint32_t cy_capsense_mw_state_t;

/** Sensor context structure */
typedef struct
{
    uint16_t raw;                                               /**< Sensor raw count */
    uint16_t bsln;                                              /**< Sensor baseline */
    uint16_t diff;                                              /**< Sensor difference count */
    uint8_t status;                                             /**< Sensor status, contains masks:
                                                                   * * bit[0] - Regular Sensor Touched (CY_CAPSENSE_SNS_TOUCH_STATUS_MASK) or Proximity Sensor is active (CY_CAPSENSE_SNS_PROX_STATUS_MASK)
                                                                   * * bit[1] - Proximity Sensor Touched  (CY_CAPSENSE_SNS_TOUCH_PROX_STATUS_MASK)
                                                                   * * bit[2] - Overflow during scanning (CY_CAPSENSE_SNS_OVERFLOW_MASK) 
                                                                */
    uint8_t negBslnRstCnt;                                      /**< Negative baseline reset counter */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t idacComp;                                       /**< Compensation IDAC of CSD or IDAC in CSX
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
    uint8_t bslnExt;                                            /**< Sensor baseline fractional */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint8_t cdacComp;                                       /**< Compensation CDAC
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */
} cy_stc_capsense_sensor_context_t;

/** CSX Touchpad touch tracking history */
typedef struct
{
    uint32_t velocity;                                          /**< The square of the "speed" (maximum distance change per refresh interval) threshold
                                                                   * distinguishing a fast finger movement from separate finger touches
                                                                   * (in [pixels/refresh interval]).
                                                                   * Squared speeds exceeding this value indicate separate finger touches.
                                                                   * Squared speeds below this value indicate fast single finger movement. */
    cy_stc_capsense_position_t oldPeak[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];
                                                                /**< Touch Positions */
    uint8_t oldPeakNumber;                                      /**< Number of detected peaks */
    uint8_t oldActiveIdsMask;                                   /**< Mask of used IDs */
} cy_stc_capsense_csx_touch_history_t;

/** Internal CSX Touchpad buffer structure for CSX for Touchpads' processing */
typedef struct
{
    int32_t distanceMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];
                                                                /**< Buffer for distance map data */
    int32_t colMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];         /**< Buffer for column map data */
    int32_t rowMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];         /**< Buffer for row map data */
    int32_t minsMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];        /**< Buffer for minimums map data */
    cy_stc_capsense_position_t newPeak[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];
                                                                /**< Touch Positions */
    int8_t fingerPosIndexMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS + 3u];
                                                                /**< Buffer for index map data */
    int8_t linksMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];        /**< Buffer for linked map data */
    int8_t visitedMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];      /**< Buffer for visited map data */
    int8_t markIndicesMap[CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS];  /**< Buffer for mark map data */
    uint8_t newPeakNumber;                                      /**< Number of detected peaks */
    uint8_t newActiveIdsMask;                                   /**< Mask of used IDs */
} cy_stc_capsense_csx_touch_buffer_t;

/** Internal WBX buffer structure for raw count correction to address sensor-to-sensor variation.
* Scaling means that corresponding value stored in variable is multiplied by 2^xE */
typedef struct
{
    uint32_t rRef;                                              /**< R coefficient */
    int32_t kCut;                                               /**< K coefficient */
    int32_t dc;                                                 /**< DC coefficient */
    uint16_t rLoad;                                             /**< Load resistance to a sensor includes 
                                                                   * external resistor and internal bus resistance */
    uint16_t rBridge;                                           /**< Nominal and/or typical WBX resistance */
    int32_t cCorr;                                              /**< C coefficient result */
    int32_t dCorr;                                              /**< D coefficient result */
} cy_stc_capsense_wbx_profile_t;

/** Widget context structure */
typedef struct
{
    uint16_t fingerCap;                                         /**< Touch sensitivity used when full auto-tuning mode is enabled:
                                                                   * * For CSD widgets is a finger capacitance introduced at touch
                                                                   * * For ISX widgets is a coil inductance change at touch */
    uint16_t sigPFC;                                            /**< The 75% of signal per the user-defined touch sensitivity parameter
                                                                   * * For Foam Detection widget defines internal scan parameter */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint16_t resolution;                                    /**< Provides scan resolution for the CSD Widgets.
                                                                 * Provides number of sub-conversions for the CSX Widgets
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
    uint16_t maxRawCount;                                       /**< Calculated maximum raw count of widget */
    uint16_t maxRawCountRow;                                    /**< Calculated row maximum raw count of widget */
    uint16_t fingerTh;                                          /**< Widget Finger Threshold or Liquid Presence Level 1 for Liquid Presence widget */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN)
        uint16_t liquidPresenceLevel2;                          /**< Liquid Presence Level 2 for Liquid Presence widget */
        uint16_t liquidPresenceLevel3;                          /**< Liquid Presence Level 3 for Liquid Presence widget */
    #endif
    uint16_t proxTh;                                            /**< Widget Proximity Threshold or Foam Correction Coefficient for Liquid level widget */
    uint16_t lowBslnRst;                                        /**< The widget low baseline reset count. Specifies the number
                                                                   * of samples the sensor signal must be below the Negative
                                                                   * Noise Threshold \ref nNoiseTh to trigger a baseline reset */
    uint16_t snsClk;                                            /**< Sense Clock Divider. For the Matrix Buttons and Touchpad widgets
                                                                   * specifies the column sense clock divider */
    uint16_t rowSnsClk;                                         /**< Row Sense Clock Divider for the Matrix Buttons and Touchpad widgets */
    uint32_t gestureDetected;                                   /**< Mask of detected gestures */
    uint32_t gestureDirection;                                  /**< Mask of directions of detected gestures */
    int16_t xDelta;                                             /**< The filtered by Ballistic Multiplier X-displacement */
    int16_t yDelta;                                             /**< The filtered by Ballistic Multiplier Y-displacement */
    uint16_t noiseTh;                                           /**< Widget Noise Threshold */
    uint16_t nNoiseTh;                                          /**< Widget Negative Noise Threshold */
    uint16_t hysteresis;                                        /**< Widget Hysteresis for the signal crossing finger threshold */
    uint8_t onDebounce;                                         /**< Widget Debounce for the signal above the finger threshold 1 to 255.
                                                                   * * 1 - touch reported immediately as soon as detected
                                                                   * * 2 - touch reported on the second consecutive detection
                                                                   * * 3 - touch reported on the third consecutive detection */
    uint8_t snsClkSource;                                       /**< Widget clock source.
                                                                   * For fourth-generation CAPSENSE&trade;:
                                                                   * * bit[7] - Indicates auto mode of clock source selection
                                                                   * * bit[0:6] - Clock source:
                                                                   *   * 0 - Direct (CY_CAPSENSE_CLK_SOURCE_DIRECT)
                                                                   *   * 1 - SSC6 (CY_CAPSENSE_CLK_SOURCE_SSC6)
                                                                   *   * 2 - SSC7 (CY_CAPSENSE_CLK_SOURCE_SSC7)
                                                                   *   * 3 - SSC9 (CY_CAPSENSE_CLK_SOURCE_SSC9)
                                                                   *   * 4 - SSC10 (CY_CAPSENSE_CLK_SOURCE_SSC10)
                                                                   *   * 5 - PRS8 (CY_CAPSENSE_CLK_SOURCE_PRS8)
                                                                   *   * 6 - PRS12 (CY_CAPSENSE_CLK_SOURCE_PRS12)
                                                                   *
                                                                   * For fifth-generation and fifth-generation low power CAPSENSE&trade;:
                                                                   * bit[3] - Indicates auto mode of PRS clock source
                                                                   * bit[2] - Indicates auto mode of SSC clock source
                                                                   * * bit[0:1] - Clock source:
                                                                   *   * 0 - Direct (CY_CAPSENSE_CLK_SOURCE_DIRECT)
                                                                   *   * 1 - SSC (CY_CAPSENSE_CLK_SOURCE_SSC)
                                                                   *   * 2 - PRS (CY_CAPSENSE_CLK_SOURCE_PRS)
                                                                   */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t idacMod[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];         /**< Sets the current of the modulation IDAC for the CSD widgets.
                                                                * For the CSD Touchpad and Matrix Button widgets sets the current of the
                                                                * modulation IDAC for the column sensors. Not used for the CSX widgets.
                                                                * \note This field is available only for the fourth-generation CAPSENSE&trade;.*/
        uint8_t idacGainIndex;                                  /**< Index of IDAC gain in table \ref cy_stc_capsense_idac_gain_table_t
                                                                * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                *  */
        uint8_t rowIdacMod[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];      /**< Sets the current of the modulation IDAC for the row sensors
                                                                * for the CSD Touchpad and Matrix Button widgets. Not used for the CSX widgets.
                                                                * \note This field is available only for the fourth-generation CAPSENSE&trade;.*/
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
    uint8_t bslnCoeff;                                          /**< Baseline IIR filter coefficient. Lower value leads to higher filtering. */
    uint32_t status;                                             /**< Contains masks:
                                                                   * * bit[0] - Widget Active (CY_CAPSENSE_WD_ACTIVE_MASK)
                                                                   * * bit[1] - Widget Enable (CY_CAPSENSE_WD_ENABLE_MASK)
                                                                   * * bit[2] - Widget Working (CY_CAPSENSE_WD_WORKING_MASK)
                                                                   * * bit[3] - Widget maximum raw count calculation enabled (CY_CAPSENSE_WD_MAXCOUNT_CALC_MASK)
                                                                   * * bit[4] - Widget row maximum raw count calculation enable (CY_CAPSENSE_WD_MAXCOUNT_ROW_CALC_MASK)
                                                                   * * bit[5] - Widget compensation CDAC direction: direct (like CSD) or inverse (CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK)
                                                                   * * bit[6] - Widget calibration mask: performs CDAC auto-calibration enable (CY_CAPSENSE_WD_FACTORY_CALIBRATION_MASK)
                                                                   * * bit[7] - Tank removal detection mask: detects the presence or absence of a physical tank connected to the device (CY_CAPSENSE_WD_TANK_REMOVAL_DETECTION_MASK)
                                                                   * * bit[8] - Liquid Presence Level 1 mask (CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL1_MASK)
                                                                   * * bit[9] - Liquid Presence Level 2 mask (CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL2_MASK)
                                                                   * * bit[10] - Liquid Presence Level 3 mask (CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL3_MASK)
                                                                   * * bit[11..13] - Finger/object type mask (CY_CAPSENSE_WD_FINGER_TYPE_MASK)
                                                                   *   * 0 (CY_CAPSENSE_FINGER_TYPE_NONE)         - Finger type has not detected
                                                                   *   * 1 (CY_CAPSENSE_FINGER_TYPE_NORMAL)       - Normal finger type
                                                                   *   * 2 (CY_CAPSENSE_FINGER_TYPE_FAT)          - Fat finger type
                                                                   *   * 3 (CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT) - Large object type
                                                                */
    cy_stc_capsense_touch_t wdTouch;                            /**< Widget touch structure used for Matrix Buttons, Sliders, and Touchpads */

    #if (CY_CAPSENSE_LINEAR_SLIDER_EN)         
        uint16_t calcTh;                                        /**< Value subtracted from each Diff count in the 5-sensor window before centroid calculation for normal fingers. 
                                                                 * Suppresses small/noisy signals so that only meaningful signal contributes to the position calculation. */
        uint16_t offsetOuterEdge;                               /**< Offset applied to the centroid weights when the peak is at the outermost sensors (index 0 or N–1). 
                                                                 * Used to improve position linearity and accuracy at the physical ends of the slider. */
        uint16_t offsetInnerEdge;                              /**< Offset applied to the centroid weights when the peak is at inner-edge sensors (index 1 or N–2). 
                                                                 * Used to improve position linearity and ensure a smooth transition between edge and core regions of the slider. */
        uint8_t fingerSigThMult;                                /**< Fraction (in 1/256 units) of the local peak signal used as a threshold for including neighboring sensors in a touch zone. 
                                                                 * Higher values make the touch zone narrower; lower values make it wider. */
        uint8_t minFatFingerSize;                               /**< Minimum number of contiguous active sensors in a touch zone required to classify the touch as a fat finger. */
        uint8_t minLargeObjectSize;                             /**< Minimum number of contiguous active sensors in a touch zone required to classify the touch as a large object (palm). */  
    #endif

