zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint16_t numSubConversions;                             /**< Number of sub-conversions in a scan
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t cdacRef;                                        /**< Sets the capacitance of the reference CDAC
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t rowCdacRef;                                     /**< Sets the capacitance of the row reference CDAC for CSD
                                                                 * Touchpad and CSD Matrix buttons widgets
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */

        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && \
             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN) || \
              (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN) || \
              (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN) || \
              (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN)))
            uint8_t cdacFine;                                   /**< Sets the capacitance of the fine CDAC
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
            uint8_t rowCdacFine;                                /**< Sets the capacitance of the row fine CDAC for CSD
                                                                 * Touchpad and CSD Matrix buttons widgets
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP && CDAC_FINE_EN) */

        uint8_t cicRate;                                        /**< Sets decimation rate when CIC2 is enabled
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
            uint8_t cdacDitherEn;                                   /**< Enabled CDAC dithering
                                                                     * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                     */
        #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */

        uint8_t cdacDitherValue;                                /**< CDAC dither scale value in bits
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t coarseInitBypassEn;                             /**< Skip Cmod coarse initialization sensors scan within widget
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t cdacCompDivider;                               /**< Number of time DAC switched in sense clock period
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t lfsrBits;                                       /**< Defines the number of LSB bits to use by the LSFR unit to achieve
                                                                 *   the desired clock dithering variation.
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint8_t cicShift;                                       /**< Sets the right shift value applied to CIC2 accumulator to form rawcounts when CIC2 is enabled
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t rowCicShift;                                       /**< Sets the right shift value applied to CIC2 accumulator to form rawcounts when CIC2 is enabled
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    uint32_t reserved0;                                         /**< Reserved for internal usage */

    #if (CY_CAPSENSE_RC_ALP_FILTER_EN)
        uint16_t alpOnTh;                                       /**< ALP filter ON threshold */
        uint16_t alpOffTh;                                      /**< ALP filter OFF threshold */
        uint8_t alpFilterCoeff;                                 /**< ALP filter filtering coefficient */
        uint8_t alpMode;                                        /**< ALP filter mode */
    #endif

} cy_stc_capsense_widget_context_t;

