zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
/** Legacy mode pin configuration structure */
typedef struct
{
    GPIO_PRT_Type * pcPtr;                                      /**< Pointer to the base port register of the IO */
    uint8_t pinNumber;                                          /**< Position of the IO in the port */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint8_t padNumber;                                      /**< Control Mux pad number
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t chId;                                           /**< Channel Id the pin belongs to
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

} cy_stc_capsense_pin_config_t;

/** Electrode objects configuration structure */
typedef struct
{
    const cy_stc_capsense_pin_config_t * ptrPin;                /**< Pointer to pin configuration structure */
    uint8_t type;                                               /**< Electrode type \ref cy_en_capsense_eltd_t */
    uint8_t numPins;                                            /**< Total number of pins in this sensor */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t chId;                                           /**< Channel Id the electrode belongs to
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
} cy_stc_capsense_electrode_config_t;

/** Configuration structure of advanced touchpad */
typedef struct
{
    uint16_t penultimateTh;                                     /**< Defines a threshold for determining arrival at edges. This
                                                                   * value may have to be increased for small diamonds, so that the edge handling is
                                                                   * initiated sooner. If this number is too high, there is jumping at the edge with
                                                                   * a smaller finger. If this number is too low, there is jumping at the edge with a
                                                                   * larger finger. */
    uint16_t virtualSnsTh;                                      /**< Defines a virtual sensor signal. This value should be set
                                                                   * to the value of any sensor when a medium-sized finger is placed directly over
                                                                   * it. If this value is too high, a position is reported nearer the edge than ideal
                                                                   * position. If this value is too low, a position is reported nearer the middle of
                                                                   * touchpad. */
    uint8_t crossCouplingTh;                                    /**< Defines cross coupling threshold. It is subtracted from
                                                                   * sensor signals at centroid position calculation to improve the accuracy.
                                                                   * The threshold should be equal to a sensor signal when your finger is near the
                                                                   * sensor, but not touching the sensor. This can be determined by slowly dragging
                                                                   * your finger across the panel and finding the inflection point of the difference
                                                                   * counts at the base of the curve. The difference value at this point should be
                                                                   * the Cross-coupling threshold. */
    uint8_t reserved0;                                          /**< Reserved field */
    uint8_t reserved1;                                          /**< Reserved field */
    uint8_t reserved2;                                          /**< Reserved field */
} cy_stc_capsense_advanced_touchpad_config_t;


#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/** Multi-phase table for de-convolution structure
 * \note This structure is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
 */
typedef struct
{
    uint32_t vector;                                            /**< Vector / pattern */
    int16_t deconvCoef[32u];                                    /**< De-convolution coefficients */
} cy_stc_capsense_mp_table_t;
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */


/** Widget configuration structure */
typedef struct
{
    cy_stc_capsense_widget_context_t * ptrWdContext;            /**< Pointer to context structure of this widget */
    cy_stc_capsense_sensor_context_t * ptrSnsContext;           /**< Pointer to the first object of sensor context structure that belongs to this widget */
    const cy_stc_capsense_electrode_config_t * ptrEltdConfig;   /**< Pointer to the first object of electrode configuration structure that belongs to this widget */
    uint32_t * ptrEltdCapacitance;                              /**< Pointer to the first object in the electrode capacitance array that belongs to this widget */

