zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint32_t * ptrSnsCapacitance;                           /**< Pointer to the first object in the sensor capacitance array that belongs to this widget.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    uint16_t * ptrBslnInv;                                      /**< Pointer to the first object in the sensor baseline inversion array that belongs to this widget */

    cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNoiseEnvelope;
                                                                /**< Pointer to the noise envelope filter used by smart sensing algorithm */
    uint16_t * ptrRawFilterHistory;                             /**< Pointer to the raw count filter history of the widget */
    uint8_t  * ptrRawFilterHistoryLow;                          /**< Pointer to the raw count filter history extended of the widget */
    uint32_t   iirCoeff;                                        /**< Raw count IIR filter coefficient. Smaller value leads to higher filtering */

    uint8_t * ptrDebounceArr;                                   /**< Pointer to the debounce array of the widget */

    const uint8_t * ptrDiplexTable;                             /**< Pointer to the diplex table used for Linear slider when Diplex option is enabled */
    uint32_t centroidConfig;                                    /**< Bit mask defining centroid configuration including centroid type, number of touches, 
                                                                   * diplexing, Foam Detection, edge correction, etc. */
    uint16_t xResolution;                                       /**< Keeps maximum position value. For Touchpads X-axis maximum position */
    uint16_t yResolution;                                       /**< For Touchpads Y-Axis maximum position */
    uint16_t numSns;                                            /**< The total number of sensors:
                                                                   * For CSD widgets: WD_NUM_ROWS + WD_NUM_COLS.
                                                                   * For CSX widgets: WD_NUM_ROWS * WD_NUM_COLS.
                                                                   * For ISX widgets: (WD_NUM_ROWS + WD_NUM_COLS) / 2 */
    uint8_t numCols;                                            /**< For CSD Button and Proximity Widgets, the number of sensors.
                                                                   * For CSD Slider Widget, the number of segments.
                                                                   * For CSD Touchpad and Matrix Button, the number of the column sensors.
                                                                   * For CSX Button, Slider, Touchpad, and Matrix Button, the number of the Rx electrodes.
                                                                   * For ISX Button and Linear Slider, the number of the Rx electrodes. */
    uint8_t numRows;                                            /**< For CSD Touchpad and Matrix Buttons, the number of the row sensors.
                                                                   * For the CSX Button and Slider, the number of the Tx electrodes (constant 1u).
                                                                   * For CSX Touchpad and Matrix Button, the number of the Tx electrodes.
                                                                   * For ISX Button and Linear Slider, the number of the Lx electrodes. */
    cy_stc_capsense_touch_t * ptrPosFilterHistory;              /**< Pointer to the position filter history */
    cy_stc_capsense_csx_touch_history_t * ptrCsxTouchHistory;   /**< Pointer to the CSX touchpad history */
    cy_stc_capsense_csx_touch_buffer_t * ptrCsxTouchBuffer;     /**< Pointer to the single CSX buffer needed for CSX touchpad processing */
    uint16_t * ptrCsdTouchBuffer;                               /**< Pointer to the CSD buffer needed for advanced CSD touchpad processing */

    cy_stc_capsense_gesture_config_t * ptrGestureConfig;        /**< Pointer to Gesture configuration structure */
    cy_stc_capsense_gesture_context_t * ptrGestureContext;      /**< Pointer to Gesture context structure */

    cy_stc_capsense_ballistic_config_t ballisticConfig;         /**< The configuration data for position ballistic filter */
    cy_stc_capsense_ballistic_context_t * ptrBallisticContext;  /**< Pointer to Ballistic filter context structure */

    cy_stc_capsense_adaptive_filter_config_t aiirConfig;        /**< The configuration of position adaptive filter */
    cy_stc_capsense_advanced_touchpad_config_t advConfig;       /**< The configuration of CSD advanced touchpad */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        cy_stc_capsense_mp_table_t * ptrMpTable;                /**< Pointer to the multi-phase vector and de-convolution coefficients
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    uint32_t posFilterConfig;                                   /**< Position filters configuration */
    uint32_t rawFilterConfig;                                   /**< Raw count filters configuration */

    uint16_t cmfThreshold;                                      /**< CMF threshold */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint16_t cdacConfig;                                    /**< Bit-mask for widget CDAC configuration:
                                                                 *  * bit[0..1]  - Reference CDAC mode (CY_CAPSENSE_CDAC_REF_MODE_MASK)
                                                                 *    * 0 (CY_CAPSENSE_CDAC_MODE_DISABLED)  - The reference CDAC is disabled
                                                                 *    * 1 (CY_CAPSENSE_CDAC_MODE_MANUAL)    - The value of reference CDAC set manually
                                                                 *    * 2 (CY_CAPSENSE_CDAC_MODE_AUTO)      - The value of reference CDAC set automatically
                                                                 *  * bit[2..3]  - Fine CDAC mode (CY_CAPSENSE_CDAC_FINE_MODE_MASK)
                                                                 *    * 0 (CY_CAPSENSE_CDAC_MODE_DISABLED)  - The fine CDAC is disabled
                                                                 *    * 1 (CY_CAPSENSE_CDAC_MODE_MANUAL)    - The value of fine CDAC set manually
                                                                 *    * 2 (CY_CAPSENSE_CDAC_MODE_AUTO)      - The value of fine CDAC set automatically
                                                                 *  * bit[4..5]  - Compensation CDAC mode (CY_CAPSENSE_CDAC_COMP_MODE_MASK)
                                                                 *    * 0 (CY_CAPSENSE_CDAC_MODE_DISABLED)  - The compensation CDAC is disabled
                                                                 *    * 1 (CY_CAPSENSE_CDAC_MODE_MANUAL)    - The value of compensation CDAC set manually
                                                                 *    * 2 (CY_CAPSENSE_CDAC_MODE_AUTO)      - The value of compensation CDAC set automatically
                                                                 *  * bit[6..7]  - Compensation CDAC divider mode (CY_CAPSENSE_CDAC_COMP_DIV_MODE_MASK)
                                                                 *    * 0 (CY_CAPSENSE_CDAC_MODE_MANUAL)    - The value of compensation CDAC divider set manually
                                                                 *    * 2 (CY_CAPSENSE_CDAC_MODE_AUTO)      - The value of compensation CDAC divider set automatically
                                                                 *  * bit[8..9]  - Sensitivity boost (CY_CAPSENSE_CDAC_BOOST_VAL_MASK)
                                                                 *    * 1 (CY_CAPSENSE_CDAC_BOOST_DISABLED) - Boost disabled
                                                                 *    * 2 (CY_CAPSENSE_CDAC_BOOST_2X)       - 2X Boost
                                                                 *    * 3 (CY_CAPSENSE_CDAC_BOOST_3X)       - 3X Boost
                                                                 *    * 4 (CY_CAPSENSE_CDAC_BOOST_4X)       - 4X Boost
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */

