zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
        uint16_t foamCoefficient;                               /**< Foam Detection coefficient. This decides the scanning cycle for foam sensing mechanism.
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t wbxResistorBridge;                             /**< Value of the fixed resistor (R1=R4) in ohm used in wheatstone bridge */
        uint16_t wbxResistorSeries;                             /**< Value of the series load resistance (RL1=RL2) in ohm */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint16_t firstSlotId;                                   /**< The slot ID in the widget to start scan from
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numSlots;                                      /**< The number of slots in the widget
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    uint8_t senseMethod;                                        /**< Specifies the widget sensing method:
                                                                    * * 0 - UNDEFINED   (CY_CAPSENSE_UNDEFINED_GROUP)
                                                                    * * 1 - CSD         (CY_CAPSENSE_CSD_GROUP)
                                                                    * * 2 - CSX         (CY_CAPSENSE_CSX_GROUP)
                                                                    * * 3 - ISX         (CY_CAPSENSE_ISX_GROUP)
                                                                    * * 4 - ISX         (CY_CAPSENSE_WBX_GROUP) */
    uint8_t wdType;                                             /**< Specifies the widget type */

    #if (CY_CAPSENSE_LINEAR_SLIDER_EN)
        uint8_t minFatFingerSizeHyst;                           /**< Hysteresis applied to the minimum fat-finger width. 
                                                                 * Helps prevent frequent switching between normal finger and fat finger 
                                                                 * when the touch width fluctuates around the fat-finger threshold. */
        uint8_t minLargeObjSizeHyst;                            /**< Hysteresis applied to the minimum large-object width. */  
    #endif  

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint8_t numChopCycles;                                  /**< Defines number of chopping cycles. One cycle means the feature is disabled
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t mpOrder;                                        /**< Multi-phase order
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            uint8_t mpOrderRows;                                 /**< Multi-phase order for rows in CSD widgets
                                                                 * \note This field is available for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */
        uint8_t lfsrDitherLimit;                                /**< Max dither in percentage. The input parameter for the LFSR range auto-selection algorithm
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade;and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t snsClkSourceAutoSelMode;                        /**< Defines set of rules that are used by clock source auto-selection algorithm
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t mfsConfig;                                      /**< Multi-frequency Scan (MFS) widget configuration
                                                                 **  Contains masks:
                                                                 * * bit[0:3] - Number of MFS Channels (CY_CAPSENSE_MFS_FREQ_CHANNELS_NUM_MASK).
                                                                 * * bit[4]   - MFS Configuration (CY_CAPSENSE_MFS_EN_MASK):
                                                                 *   * 0 - MFS Disabled.
                                                                 *   * 1 - MFS Enabled (Base or Frequency channel widget).
                                                                 * * bit[5:6]   - Widget attribute (CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK):
                                                                 *   * 0 - Base widget
                                                                 *   * 1 - Frequency channel 1 widget (CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK)
                                                                 *   * 2 - Frequency channel 2 widget (CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK)
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t cdacDitherScaleMode;                            /**< CDAC dither scale mode
                                                                 * * 0 (CY_CAPSENSE_CDAC_DITHERING_MODE_DISABLE) - CDAC dithering is disabled
                                                                 * * 1 (CY_CAPSENSE_CDAC_DITHERING_MODE_MANUAL)  - CDAC dither value set manually
                                                                 * * 2 (CY_CAPSENSE_CDAC_DITHERING_MODE_AUTO)    - CDAC dither value set automatically
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint8_t cicRateMode;                                    /**< CIC2 filter decimation rate mode
                                                                 * * 0 (CY_CAPSENSE_CIC_RATE_MODE_MANUAL)     - The cicRate value set by users
                                                                 * * 1 (CY_CAPSENSE_CIC_RATE_MODE_AUTO)       - The cicRate value configured by middleware
                                                                 * * 2 (CY_CAPSENSE_CIC_RATE_MODE_SMARTSENSE) - The cicRate value configured by SMARTSENSE&trade; algorithm
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t iirCoeffHw;                                     /**< Raw count HW IIR filter coefficient. Smaller value leads to lower filtering.
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t wbxCorrectionEn;                                /**< Enables sensitivity correction to address the sensitivity variation across part to part */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
        uint8_t cRefSource;                                     /**< Reference capacitor source selection:
                                                                 * * 0 (CY_CAPSENSE_CREF_SOURCE_INTERNAL) - Use internal CDAC (default)
                                                                 * * 1 (CY_CAPSENSE_CREF_SOURCE_EXTERNAL) - Use external capacitor
                                                                 * \note This field is available only for the fifth-generation
                                                                 * CAPSENSE&trade; PSOC&trade; 4 HVMS devices.
                                                                 */
    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
} cy_stc_capsense_widget_config_t;

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/** Declares the IDAC gain table
 * \note This structure is available only for the fourth-generation CAPSENSE&trade;.
*/
typedef struct
{
    uint32_t gainReg;                                           /**< Register value of IDAC gain */
    uint32_t gainValue;                                         /**< Absolute gain value in pA */
} cy_stc_capsense_idac_gain_table_t;
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

