zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/** Declares the scan order of widget and sensor
 * \note This structure is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
 */
typedef struct
{
    uint16_t wdId;                                              /**< Specifies the widget ID for the current scan slot */
    uint16_t snsId;                                             /**< Specifies the sensor ID for the current scan slot */
} cy_stc_capsense_scan_slot_t;
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/** Declares MSC channel (HW block) configuration
 * \note This structure is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
 */
typedef struct
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        MSC_Type * ptrHwBase;                              /**< Pointer to the MSC HW block register
                                                            * \note This structure is available only for the fifth-generation CAPSENSE&trade;
                                                            */
        cy_stc_msc_context_t * ptrHwContext;               /**< Pointer to the MSC driver context
                                                            * \note This structure is available only for the fifth-generation CAPSENSE&trade;
                                                            */
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        MSCLP_Type * ptrHwBase;                            /**< Pointer to the MSCLP HW block register
                                                            * \note This structure is available only for the fifth-generation low power CAPSENSE&trade;
                                                            */
        cy_stc_msclp_context_t * ptrHwContext;             /**< Pointer to the MSCLP driver context
                                                            * \note This structure is available only for the fifth-generation low power CAPSENSE&trade;
                                                            */
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */

    GPIO_PRT_Type * portCmod1;                              /**< The pointer to the Cmod1 pin base port register */
    uint8_t pinCmod1;                                       /**< The Cmod1 pin position (bit number) in the port */

    GPIO_PRT_Type * portCmod2;                              /**< The pointer to the Cmod2 pin base port register */
    uint8_t pinCmod2;                                       /**< The Cmod2 pin position (bit number) in the port */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t dmaWrChIndex;                               /**< Specifies the DMA Write channel index
                                                             * \note This structure is available only for the fifth-generation CAPSENSE&trade;
                                                             */
        uint8_t dmaChainWrChIndex;                          /**< Specifies the DMA Chain Write channel index
                                                             * \note This structure is available only for the fifth-generation CAPSENSE&trade;
                                                             */
        uint8_t dmaRdChIndex;                               /**< Specifies the DMA Read channel index
                                                             * \note This structure is available only for the fifth-generation CAPSENSE&trade;
                                                             */
        uint8_t dmaChainRdChIndex;                          /**< Specifies the DMA Chain Read channel index
                                                             * \note This structure is available only for the fifth-generation CAPSENSE&trade;
                                                             */
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */

    const cy_stc_capsense_electrode_config_t * ptrShieldEltdConfig;   /**< Pointer to the first object of shield electrode configuration */

} cy_stc_capsense_channel_config_t;
#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */


/** Common configuration structure */
typedef struct
{
    uint32_t cpuClkHz;                                          /**< CPU clock in Hz */
    uint32_t periClkHz;                                         /**< Peripheral clock in Hz */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        cy_stc_capsense_idac_gain_table_t idacGainTable[CY_CAPSENSE_IDAC_GAIN_TABLE_SIZE];
                                                                /**< Table with the supported IDAC gains and corresponding register values
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        CSD_Type * ptrCsdBase;                                  /**< Pointer to the CSD HW block register
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        cy_stc_csd_context_t * ptrCsdContext;                   /**< Pointer to the CSD driver context
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCmod;                               /**< Pointer to the base port register of the Cmod pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCsh;                                /**< Pointer to the base port register of the Csh pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCintA;                              /**< Pointer to the base port register of the CintA pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        GPIO_PRT_Type * portCintB;                              /**< Pointer to the base port register of the CintB pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN */

