zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        cy_stc_capsense_channel_config_t * ptrChConfig;         /**< The pointer to the CAPSENSE&trade; enabled channel (HW block) configuration
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        DMAC_Type * ptrDmacBase;                                /**< Pointer to the DMAC HW block base register
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const uint32_t * const * ptrDmaWrChSnsCfgAddr;          /**< Pointer to the array containing the addresses of sensor configurations
                                                                 * used as a source for the DMA Chain Write channel
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const uint16_t * const * ptrDmaRdChSnsCfgAddr;          /**< Pointer to the array containing the addresses of sensor configurations
                                                                 * used as a source for the DMA Chain Read channel
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const uint32_t ** ptrDmaWrChSnsCfgAddrLocal;            /**< Pointer to the array containing the addresses of sensor configurations
                                                                 * used as a source for the DMA Chain Write channel
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        const uint16_t ** ptrDmaRdChSnsCfgAddrLocal;            /**< Pointer to the array containing the addresses of sensor configurations
                                                                 * used as a source for the DMA Chain Read channel
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint16_t * ptrEmptyRawCount;                            /**< Pointer to the empty storage for raw count in case widget is disabled.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */

    uint16_t numPin;                                            /**< Total number of IOs. */
    uint16_t numSns;                                            /**< The total number of sensors. It is equal to the number of objects with raw count.
                                                                   * * For CSD widgets: WD_NUM_ROWS + WD_NUM_COLS
                                                                   * * For CSX widgets: WD_NUM_ROWS * WD_NUM_COLS */
    uint16_t proxTouchCoeff;                                    /**< Proximity touch coefficient in percentage used in smart sensing algorithm */
    uint16_t csdRConst;                                         /**< Sensor resistance in series used by smart sensing algorithm */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint16_t vdda;                                          /**< VDDA in mV */
        uint16_t csdVref;                                       /**< Vref for CSD method
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint16_t numEpiCycles;                                  /**< Number of clk_mod cycles to be run during EPILOGUE
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numCoarseInitChargeCycles;                     /**< Configure duration of Cmod initialization, phase 1
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numCoarseInitSettleCycles;                     /**< Configure duration of Cmod initialization, phase 2
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numSlots;                                      /**< Total number of slots
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint16_t numProWaitKrefDelayPrs;                        /**< Number of Kref/4 ProDummy Wait Cycles if PRS is enabled
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numProWaitKrefDelay;                           /**< Number of Kref/4 ProDummy Wait Cycles if PRS is disabled
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numEpiKrefDelayPrs;                            /**< Number of Kref/4 cycles to be run during EPILOGUE if PRS is enabled
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint16_t numEpiKrefDelay;                               /**< Number of Kref/4 cycles to be run during EPILOGUE if PRS is disabled
                                                                 * \note This field is available only for the fifth-generation pow power CAPSENSE&trade;.
                                                                 */
        uint8_t wbxInactiveSnsConnection;                       /**< Inactive sensor connection for WBX scan:
                                                                * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                * * CY_CAPSENSE_SNS_CONNECTION_GROUND
                                                                * 
                                                                * Applicable only for fifth-generation low power CAPSENSE&trade;.
                                                                */
        uint8_t wbxCalibrationError;                            /**< Acceptable calibration error
                                                                * \note This structure is available only for the fifth-generation low power CAPSENSE&trade;
                                                                */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    uint8_t numWd;                                              /**< Total number of widgets */
    uint8_t periDividerType;                                    /**< Peripheral clock type (8- or 16-bit type) */
    uint8_t periDividerIndex;                                   /**< Peripheral divider index */
    uint8_t analogWakeupDelay;                                  /**< Time needed to establish correct operation of CAPSENSE&trade; HW block block after power up or System Deep Sleep. */
    uint8_t swSensorAutoResetEn;                                /**< Sensor auto reset enabled */

