zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    uint8_t csdInactiveSnsConnection;                           /**< Inactive sensor connection for CSD scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint8_t csxInactiveSnsConnection;                           /**< Inactive sensor connection for CSX scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2
                                                                   *
                                                                   * CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 is only available for fifth-generation
                                                                   * and fifth-generation low power CAPSENSE&trade;.
                                                                   */
    uint8_t isxInactiveSnsConnection;                           /**< Inactive sensor connection for ISX scan:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   *
                                                                   * Applicable only for fifth-generation low power CAPSENSE&trade;.
                                                                   */
    uint8_t csdShieldNumPin;                                    /**< Number of shield IOs */

    uint8_t csxRawTarget;                                       /**< Raw count target in percentage for CSX calibration */
    uint8_t csxCalibrationError;                                /**< Acceptable calibration error */
    uint8_t csdRawTarget;                                       /**< Raw count target in percentage for CSD calibration */
    uint8_t csdCalibrationError;                                /**< Acceptable calibration error */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t ssIrefSource;                                   /**< Iref source
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  * */
        uint8_t ssVrefSource;                                   /**< Vref source
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCmodPadNum;                                 /**< Number of port of dedicated Cmod pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCmodPad;                                     /**< Position of the dedicated Cmod pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCshPadNum;                                  /**< Number of port of dedicated Csh pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCshPad;                                      /**< Position of the dedicated Csh pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portShieldPadNum;                               /**< Number of port of dedicated Shield pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinShieldPad;                                   /**< Position of the dedicated Shield pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portVrefExtPadNum;                              /**< Number of port of dedicated VrefExt pad
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinVrefExtPad;                                  /**< Position of the dedicated VrefExt pad in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCmodNum;                                    /**< Number of port of Cmod pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCmod;                                        /**< Position of the Cmod pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t portCshNum;                                     /**< Number of port of Csh pin
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCsh;                                         /**< Position of the Csh pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCintA;                                       /**< Position of the CintA pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t pinCintB;                                       /**< Position of the CintB pin in the port
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdShieldDelay;                                 /**< Shield signal delay
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdShieldSwRes;                                 /**< Shield switch resistance
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdInitSwRes;                                   /**< Switch resistance at coarse initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdChargeTransfer;                              /**< IDAC sensing configuration
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdIdacGainInitIndex;                           /**< IDAC gain index per \ref idacGainTable
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdIdacMin;                                     /**< Min acceptable IDAC value in CSD calibration
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdFineInitTime;                                /**< Number of dummy SnsClk periods at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdMfsDividerOffsetF1;                          /**< Frequency divider offset for channel 1. This value is added to
                                                                  * base (channel 0) SnsClk divider to form channel 1 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csdMfsDividerOffsetF2;                          /**< Frequency divider offset for channel 2. This value is added to
                                                                  * base (channel 0) SnsClk divider to form channel 2 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxFineInitTime;                                /**< Number of dummy TX periods at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxInitSwRes;                                   /**< Switch resistance at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxScanSwRes;                                   /**< Switch resistance at scanning
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxInitShieldSwRes;                             /**< Switch resistance at fine initialization
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxScanShieldSwRes;                             /**< Switch resistance at scanning
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxMfsDividerOffsetF1;                          /**< Frequency divider offset for channel 1. This value is added to
                                                                  * base (channel 0) Tx divider to form channel 1 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t csxMfsDividerOffsetF2;                          /**< Frequency divider offset for channel 2. This value is added to
                                                                  * base (channel 0) Tx divider to form channel 2 frequency
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

