zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint8_t isxRawTarget;                                   /**< Raw count target in percentage for ISX calibration
                                                                  * \note This structure is available only for the fifth-generation low power CAPSENSE&trade;
                                                                  */
        uint8_t isxCalibrationError;                            /**< Acceptable calibration error
                                                                  * \note This structure is available only for the fifth-generation low power CAPSENSE&trade;
                                                                  */
        uint8_t wbxRawTarget;                                   /**< Raw count target in percentage for WBX calibration
                                                                  * \note This structure is available only for the fifth-generation low power CAPSENSE&trade;
                                                                  */
        uint8_t csdShieldMode;                                  /**< Shield mode
                                                                 * * CY_CAPSENSE_SHIELD_DISABLED
                                                                 * * CY_CAPSENSE_SHIELD_ACTIVE
                                                                 * * CY_CAPSENSE_SHIELD_PASSIVE
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t numProOffsetCycles;                             /**< Maximum number of clk_mod cycles for the PRO_OFFSET state.
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t proOffsetCdacComp;                              /**< Compensation CAPDAC size during PRO_OFFSET.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t chopPolarity;                                   /**< Select polarity for system level chopping
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t numBadScans;                                    /**< 1 to 7, repeat scan upon "bad" scan. Disabled = 0.
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
        uint8_t counterMode;                                    /**< Select overflow or saturate mode for raw count:
                                                                 * * 0 - CY_CAPSENSE_COUNTER_MODE_SATURATE
                                                                 * * 1 - CY_CAPSENSE_COUNTER_MODE_OVERFLOW
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t sensorConnection;                               /**< Sensor Connection. In CS-DMA mode, sensor connection always set to CTRLMUX.
                                                                 * * 0 - CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD:
                                                                 *       All AMUX capable GPIOs available as sensor.
                                                                 * * 1 - CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD:
                                                                 *       Only dedicated GPIO available as sensor.
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t syncClockEn;                                    /**< Enable external synchronization signals
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t syncMode;                                       /**< Synchronization mode:
                                                                 * * 0 - CY_CAPSENSE_SYNC_MODE_OFF
                                                                 * * 1 - CY_CAPSENSE_SYNC_EXTERNAL
                                                                 * * 2 - CY_CAPSENSE_SYNC_INTERNAL
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t masterChannelId;                                /**< The ID of the Master channel MULTI-CHIP solution.
                                                                 * This channel will generate msc_ext_frm_start_out
                                                                 * and msc_ext_sync_clk_out signals
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t numChannels;                                    /**< The number of CAPSENSE&trade; enabled MSCv3 blocks in the current chip
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t channelOffset;                                  /**< The ID of the first channel that belongs to the current chip
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t syncFrameStartEn;                               /**< Enable external synchronization signals
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
} cy_stc_capsense_common_config_t;


/** Declares BIST Context Data Structure */
typedef struct
{
    cy_en_capsense_bist_hw_config_t hwConfig;                   /**< A HW configuration for BIST operations */
    cy_en_capsense_bist_io_state_t currentISC;                  /**< The current state of sensors when not being measured during the sensor capacitance measurement */
    cy_en_capsense_bist_io_state_t shieldCapISC;                /**< The configured inactive electrode connection for BIST shield electrode capacitance measurement.
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t eltdCapCsdISC;               /**< The configured inactive electrode connection for BIST CSD sensor or electrode capacitance measurement:
                                                                     The states are the same as of the previous parameter */
    cy_en_capsense_bist_io_state_t eltdCapCsxISC;               /**< The configured inactive electrode connection for BIST CSX sensor or electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t intrEltdCapShieldISC;        /**< The internal inactive electrode connection used during the BIST shield electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t intrEltdCapCsdISC;           /**< The internal inactive electrode connection used during the BIST CSD sensor or electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    cy_en_capsense_bist_io_state_t intrEltdCapCsxISC;           /**< The internal inactive electrode connection used during the BIST CSX sensor or electrode capacitance measurement:
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                   * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint32_t testResultMask;                                    /**< The bit mask of test results (PASS/FAIL) */
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    uint32_t shieldCap;                                         /**< The shield capacitance measurement result in femtofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

