zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    uint32_t * ptrChShieldCap;                                  /**< The pointer to the channel shield capacitance measurement result array
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

#if ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    uint16_t vddaVoltage;                                       /**< The result of VDDA measurement in millivolts
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    uint32_t eltdCapSnsClkFreqHz;                               /**< The value of the SnsClk frequency is Hz */
    uint16_t * ptrWdgtCrc;                                      /**< The pointer to the widget CRC array */

    uint16_t wdgtCrcCalc;                                       /**< A calculated by test CRC for a widget context structure */

    uint16_t eltdCapModClk;                                     /**< The ModClk divider for electrode capacitance measurement scans */
    uint16_t eltdCapSnsClk;                                     /**< The SnsClk divider for electrode capacitance measurement scans */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    uint16_t curBistWdId;                                       /**< The current widget ID for BIST operations
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade;.
                                                                 */
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    uint8_t eltdCapSenseGroup;                                  /**< The sensor group for capacitance measurement:
                                                                    * * 0 - UNDEFINED   (CY_CAPSENSE_UNDEFINED_GROUP)
                                                                    * * 1 - CSD         (CY_CAPSENSE_CSD_GROUP)
                                                                    * * 2 - CSX         (CY_CAPSENSE_CSX_GROUP) */
    uint8_t crcWdgtId;                                          /**< The first CRC failed widget ID */
    uint8_t snsIntgShortSettlingTime;                           /**< The sensor and shield short check time in microseconds */
    uint8_t shortedWdId;                                        /**< The first shorted to GND/VDDA/ELTD widget ID */
    uint8_t shortedSnsId;                                       /**< The first shorted to GND/VDDA/ELTD sensor ID */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    uint32_t regSwHsPSelScan;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t regSwHsPSelCmodInit;                               /**< Internal pre-calculated data for faster operation */
    uint32_t regSwHsPSelCtankInit;                              /**< Internal pre-calculated data for faster operation */
    uint32_t regSwDsiSel;                                       /**< Internal pre-calculated data for faster operation */
    uint32_t regSwShieldSelScan;                                /**< Internal pre-calculated data for faster operation */
    uint32_t regSwResInit;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwResScan;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwBypSel;                                       /**< Internal pre-calculated data for faster operation */
    uint32_t regSwAmuxbufSel;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t regAmbuf;                                          /**< Internal pre-calculated data for faster operation */
    uint32_t regHscmpScan;                                      /**< Internal pre-calculated data for faster operation */
    uint32_t regSwRefgenSel;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t regConfig;                                         /**< Internal pre-calculated data for faster operation */
    uint32_t regIoSel;                                          /**< Internal pre-calculated data for faster operation */
    uint32_t regAmbufShield;                                    /**< Internal pre-calculated data for faster operation */
    uint32_t regHscmpScanShield;                                /**< Internal pre-calculated data for faster operation */
    uint32_t regSwShieldSelScanShield;                          /**< Internal pre-calculated data for faster operation */
    uint32_t regSwHsPSelScanShield;                             /**< Internal pre-calculated data for faster operation */
    uint32_t regSwBypSelShield;                                 /**< Internal pre-calculated data for faster operation */
    uint32_t regSwAmuxbufSelShield;                             /**< Internal pre-calculated data for faster operation */
    uint32_t regConfigShield;                                   /**< Internal pre-calculated data for faster operation */
    uint32_t regIoSelShield;                                    /**< Internal pre-calculated data for faster operation */

    uint32_t extCapIdacPa;                                      /**< The IDAC value in pA for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapModClk;                                      /**< The ModClk divider for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapSnsClk;                                      /**< The SnsClk divider for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapWDT;                                         /**< The SW watchdog timeout used to prevent a hang in case of short
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t extCapVrefMv;                                      /**< The Vref value in mV for external capacitor capacity measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cModCap;                                           /**< The Cmod capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cIntACap;                                          /**< The CintA capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cIntBCap;                                          /**< The CIntB capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t cShieldCap;                                        /**< The Cshield capacitance measurement result in picofarads
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t capacitorSettlingTime;                             /**< The maximum possible external capacitor charge/discharge time in microseconds
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t vddaModClk;                                        /**< The ModClk divider for VDDA measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t vddaVrefMv;                                        /**< The Vref value in mV for VDDA measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapVrefMv;                                     /**< The Vref value in mV for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapResolution;                                 /**< The resolution for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */

    uint8_t vddaIdacDefault;                                    /**< The IDAC default code for Vdda measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t vddaAzCycles;                                       /**< The auto-zero time in Sns cycles for Vdda measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t vddaAcqCycles;                                      /**< The acquisition time in Sns cycles - 1 for Vdda measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t fineInitTime;                                       /**< Number of dummy SnsClk periods at fine initialization for BIST scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapVrefGain;                                    /**< The Vref gain for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t vddaVrefGain;                                       /**< The Vref gain for VDDA measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t extCapVrefGain;                                     /**< The Vref gain for external capacitor capacitance measurements
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

