zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    const cy_stc_capsense_electrode_config_t * curPtrEltdCfg;   /**< The pointer to the current electrode configuration for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint32_t eltdInactiveDm;                                    /**< Internal pre-calculated data for faster operation */
    en_hsiom_sel_t eltdInactiveHsiom;                           /**< Internal pre-calculated data for faster operation */

    uint16_t curBistSlotId;                                     /**< The current slot ID for BIST operations
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapSubConvNum;                                  /**< The sub-conversion number for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumEpiCycles;                               /**< Number of clk_mod cycles to be run during EPILOGUE
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumCoarseInitChargeCycles;                  /**< Configure duration of Cmod initialization, phase 1
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumCoarseInitSettleCycles;                  /**< Configure duration of Cmod initialization, phase 2
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t eltdCapNumFineInitWaitCycles;                      /**< Number of ProDummy Wait Cycles
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN))
    uint16_t extCapDischargeTime;                               /**< The discharging time in us needed to discharge
                                                                 * the external capacitor before the measurement
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t extCapSubConvNum;                                  /**< The sub-conversion number for Cmod measurement
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN))) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
    uint16_t extCapWDT;                                         /**< The SW watchdog timeout used to prevent a hang
                                                                 * in case of short the external capacitor
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t cMod01Cap;                                         /**< The MSC0 Cmod1 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t cMod02Cap;                                         /**< The MSC0 Cmod2 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */

