zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || \
     ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && (1u == MSCLP_CMOD34_PRESENT)))
    uint16_t cMod03Cap;                                         /**< The MSC0 Cmod3 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
    uint16_t cMod04Cap;                                         /**< The MSC0 Cmod4 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade; and fifth-generation
                                                                 * low power CAPSENSE&trade;.
                                                                 */
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || \
           ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && (1u == MSCLP_CMOD34_PRESENT))) */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    uint16_t cMod11Cap;                                         /**< The MSC1 Cmod1 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade;.
                                                                 */
    uint16_t cMod12Cap;                                         /**< The MSC1 Cmod2 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade;.
                                                                 */
    uint16_t cMod13Cap;                                         /**< The MSC1 Cmod3 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade;.
                                                                 */
    uint16_t cMod14Cap;                                         /**< The MSC1 Cmod4 capacitance measurement result
                                                                 * in picofarads
                                                                 * \note This field is available only for the fifth-
                                                                 * generation CAPSENSE&trade;.
                                                                 */
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FORTH_GEN) */

#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) */

    uint8_t eltdCapNumFineInitCycles;                           /**< Number of ProDummy SubConversions
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapRefCdac;                                     /**< The reference CDAC code for electrode capacitance measurement scans
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t curBistChId;                                        /**< The current MSCv3 channel ID for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t skipChannelMask;                                    /**< The skip channel mask for BIST operations
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    uint8_t eltdCapScanMode;                                    /**< The scan mode for sensor (electrode) capacitance measurement
                                                                 * * 0u - scan by slots (CY_CAPSENSE_BIST_CAP_SLOT_SCAN)
                                                                 * * 1u - scan by electrodes (CY_CAPSENSE_BIST_CAP_ELTD_SCAN)
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */
}
cy_stc_capsense_bist_context_t;


#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/** Declares the BIST structure with custom scan parameters
 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
 */
typedef struct
{
    uint16_t modClk;                                            /**< The ModClk divider for a custom scan. The minimum value is 1 and the maximum depends on a divider type,
                                                                     but for a reliable CSD HW block operation, it is recommended to provide
                                                                     a modulation clock frequency in the range from 1 to 50 MHz */
    uint16_t snsClk;                                            /**< The SnsClk divider for a custom scan. The minimum value is 4 and the maximum is 4095,
                                                                     but for a reliable CSD HW block operation, it is recommended to provide
                                                                     an sensor clock frequency in the range from 100 to 6000 kHz */
    uint16_t convNum;                                           /**< The number of conversions for a custom scan. The maximum raw counts is equal (convNum * snsClkDivider - 1),
                                                                     that corresponds to (2^Resolution - 1) in older notations. The minimum value is 4 and the maximum is 65535,
                                                                     but as the maximum raw counts is 65535, the convNum value should be less than (65536 / snsClkDivider) */
    cy_en_capsense_bist_io_state_t customISC;                   /**< The inactive state of sensors during the custom scan */
    uint8_t reserved0;                                          /**< Reserved field */

    uint8_t vrefGain;                                           /**< The Vref gain for a custom scan */
    uint8_t idacMod;                                            /**< Sets the code of the modulation IDAC for a custom scan */
    uint8_t idacGainIndex;                                      /**< Index of IDAC gain in table \ref cy_stc_capsense_idac_gain_table_t */
    uint8_t fineInitTime;                                       /**< Number of dummy SnsClk periods at fine initialization for a custom scan */

}cy_stc_capsense_bist_custom_parameters_t;
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */


