zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
/** Declares active sensor details */
typedef struct
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        const cy_stc_capsense_widget_config_t * ptrWdConfig;    /**< Pointer to the widget configuration structure of the active sensor */
        cy_stc_capsense_widget_context_t * ptrWdContext;        /**< Pointer to the widget context structure of the active sensor */
        uint8_t scanScope;                                      /**< Keeps request of scanning either:
                                                                   * * CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS - Single sensor
                                                                   * * CY_CAPSENSE_SCAN_SCOPE_ALL_SNS_MASK - All sensors of one widget
                                                                   * * CY_CAPSENSE_SCAN_SCOPE_ALL_WD_MASK - All widgets */
        uint8_t mfsChannelIndex;                                /**< MFS channel index
                                                                  * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                  */
        uint8_t rxIndex;                                        /**< Current Rx ID */
        uint8_t txIndex;                                        /**< Current Tx ID */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

    const cy_stc_capsense_electrode_config_t * ptrEltdConfig;   /**< Pointer to the electrode configuration structure of the active sensor */
    const cy_stc_capsense_electrode_config_t * ptrRxConfig;     /**< Pointer to the Rx electrode configuration structure of the active sensor */
    const cy_stc_capsense_electrode_config_t * ptrTxConfig;     /**< Pointer to the Tx electrode configuration structure of the active sensor */

    cy_stc_capsense_sensor_context_t * ptrSnsContext;           /**< Pointer to the sensor context structure */

    uint16_t currentChannelSlotIndex;                           /**< Current slot Index for channel */
    uint16_t sensorIndex;                                       /**< Current sensor ID */
    uint8_t widgetIndex;                                        /**< Current widget ID */
    uint8_t currentSenseMethod;                                 /**< Current sensing method */
    uint8_t connectedSnsState;                                  /**< Shows if the current sensor is connected to analog bus */
} cy_stc_capsense_active_scan_sns_t;


/**
* Provides the typedef for the callback function that is intended to be called when
* the \ref cy_en_capsense_callback_event_t events occurs.
*/
typedef void (*cy_capsense_callback_t)(cy_stc_capsense_active_scan_sns_t * ptrActiveScan);

#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    /**
    * Provides the typedef for the callback function that is called by the
    * Cy_CapSense_Enable() function to change the CAPSENSE&trade; configuration from
    * the default configuration to the user's specific use cases.
    * Refer to \ref group_capsense_callbacks section.
    *
    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
    */
    typedef void (*cy_capsense_ds_init_callback_t)(void * context);
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

/**
* Provides the typedef for the callback function that is called by the
* Cy_CapSense_RunTuner() function to establish communication with
* the CAPSENSE&trade; Tuner tool to monitor CAPSENSE&trade; operation.
* For the fifth-generation low power CAPSENSE&trade; the callback is called only once for each new scan.
* For the previous CAPSENSE&trade; generations the callback is called once per scan cycle or periodically if device is in suspended mode.
* Refer to \ref group_capsense_callbacks section.
*/
typedef void (*cy_capsense_tuner_send_callback_t)(void * context);

/**
* Provides the typedef for the callback function that is called by the
* Cy_CapSense_RunTuner() function to establish communication with
* the CAPSENSE&trade; Tuner tool to support life-time tuning.
* Refer to \ref group_capsense_callbacks section.
*/
typedef void (*cy_capsense_tuner_receive_callback_t)(uint8_t ** commandPacket, uint8_t ** tunerPacket, void * context);


/** Declares internal Context Data Structure */
typedef struct
{
    cy_capsense_callback_t ptrSSCallback;                          /**< Pointer to a user's Start Sample callback function. Refer to \ref group_capsense_callbacks section */
    cy_capsense_callback_t ptrEOSCallback;                         /**< Pointer to a user's End Of Scan callback function. Refer to \ref group_capsense_callbacks section */
    cy_capsense_tuner_send_callback_t ptrTunerSendCallback;        /**< Pointer to a user's tuner callback function. Refer to \ref group_capsense_callbacks section */
    cy_capsense_tuner_receive_callback_t ptrTunerReceiveCallback;  /**< Pointer to a user's tuner callback function. Refer to \ref group_capsense_callbacks section */

    void (* ptrISRCallback)(void * context);                       /**< Pointer to the scan interrupt handler */

    #if (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint32_t csdInactiveSnsDm;                                 /**< Internal pre-calculated data for faster operation */
        uint32_t csxInactiveSnsDm;                                 /**< Internal pre-calculated data for faster operation */
    #endif /* (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint32_t csdRegConfig;                                     /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwHsPSelScan;                               /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwHsPSelCmodInit;                           /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwHsPSelCtankInit;                          /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwBypSel;                                   /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwResScan;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwResInit;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwDsiSel;                                   /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegAmuxbufInit;                                /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwAmuxbufSel;                               /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwShieldSelScan;                            /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegHscmpInit;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegHscmpScan;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdIdacAConfig;                                   /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdIdacBConfig;                                   /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwCmpPSel;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwCmpNSel;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegIoSel;                                      /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegRefgen;                                     /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csdRegSwRefGenSel;                                /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */

        uint32_t csxRegConfigInit;                                 /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegConfigScan;                                 /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegSwResInit;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegSwResPrech;                                 /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegSwResScan;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegAMuxBuf;                                    /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegRefgen;                                     /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegRefgenSel;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegSwCmpNSel;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint32_t csxRegSwRefGenSel;                                /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint16_t csdVrefVoltageMv;                                 /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint8_t csdCmodConnection;                                 /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint8_t csdCshConnection;                                  /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
        uint8_t csdVrefGain;                                       /**< Internal pre-calculated data for faster operation
                                                                    * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                    */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

