zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        cy_capsense_ds_init_callback_t ptrEODsInitCallback;        /**< Pointer to a user's End Of Data Structure Initialization callback function. Refer to \ref group_capsense_callbacks section
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
            uint32_t snsCtlReg[CY_CAPSENSE_TOTAL_CH_NUMBER];       /**< Keeps value of non-retention SNS_CTL register for LFT mode */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            uint32_t snsCtlReg;                                    /**< Keeps value of non-retention SNS_CTL register for LFT mode */
            uint32_t activeWakeupTimer;                            /**< The wakeup timer value for the ACTIVE scan mode in microseconds
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint32_t activeWakeupTimerCycles;                      /**< The wakeup timer value for the ACTIVE scan mode in ILO cycles
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint32_t wotScanInterval;                              /**< Scan refresh interval (us) while in Wake-on-Touch mode.
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint32_t wotScanIntervalCycles;                        /**< The scan refresh interval value for the Wake-on-Touch scan mode in ILO cycles
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint32_t iloCompensationFactor;                        /**< The ILO compensation factor value, calculated as actual ILO frequency (Hz) * 2^14 / 1000000
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

        uint16_t numCoarseInitChargeCycles;                        /**< Configure duration of Cmod initialization, phase 1
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint16_t numCoarseInitSettleCycles;                        /**< Configure duration of Cmod initialization, phase 2
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint16_t currentSlotIndex;                                 /**< Current slot ID
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint16_t endSlotIndex;                                     /**< The last slot ID for the current frame
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint16_t numValidSlots;                                    /**< Number of valid slots
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint16_t firstValidSlot;                                  /**< The first valid slots ID
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint16_t lfsrPoly;                                         /**< LFSR Polynomial
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
            uint16_t numFineInitWaitCycles;                        /**< Number of ProDummy Wait Cycles
                                                                    * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                    */
            uint16_t numEpiCycles;                                 /**< Number of clk_mod cycles to be run during EPILOGUE
                                                                    * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                    */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            uint16_t numProWaitKrefDelayPrs;                       /**< Number of Kref/4 ProDummy Wait Cycles if PRS is enabled
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint16_t numProWaitKrefDelay;                          /**< Number of Kref/4 ProDummy Wait Cycles if PRS is disabled
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint16_t numEpiKrefDelayPrs;                           /**< Number of Kref/4 cycles to be run during EPILOGUE if PRS is enabled
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint16_t numEpiKrefDelay;                              /**< Number of Kref/4 cycles to be run during EPILOGUE if PRS is disabled
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint16_t numSlots;                                     /**< The number of slots in the current frame
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint16_t startSlotIndex;                               /**< The start slot ID for the current scan
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint16_t wotTimeout;                                   /**< The number of frames to be scanned in Wake-on-Touch mode when there is no touch.
                                                                    * The maximum value is limited to the 14 bits, the applicable range is [1..16383].
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t intrWbxInactSnsConn;                           /**< Internal inactive electrode connection for WBX scan:
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

        uint8_t intrIsxInactSnsConn;                               /**< Internal inactive electrode connection for ISX scan:
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
        uint8_t numFineInitCycles;                                 /**< Number of ProDummy SubConversions
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t lfsrScale;                                         /**< LFSR Scale value
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t cdacDitherSeed;                                    /**< Dither CDAC Seed
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t cdacDitherPoly;                                    /**< Dither CDAC Polynomial
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t modClk;                                            /**< The modulator clock divider
                                                                    * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t scanSingleSlot;                                    /**< Request of scanning just one slot with keeping HW configuration after scan:
                                                                    * * CY_CAPSENSE_SCAN_SNGL_SLOT - Single slot scanning
                                                                    * * CY_CAPSENSE_SCAN_MULTIPLE_SLOT - Multiple slot scanning
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t numProOffsetCycles;                                /**< Maximum number of clk_mod cycles for the PRO_OFFSET state.
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t proOffsetCdacComp;                                 /**< Compensation CAPDAC size during PRO_OFFSET.
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t hwConfigState;                                     /**< Contains the current hw state, it is configured or not and if yes then to what operation
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t slotAutoCalibrMode;                                /**< The slot auto-calibration mode:
                                                                    * * 0 - CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR
                                                                    * * 2 - CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR
                                                                    * * 3 - CY_CAPSENSE_CAL_MODE_FINE_CDAC_SUC_APPR
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t intrCsdRawTarget;                                  /**< Internal auto-calibration target in percentage for CSD widgets
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t intrCsxRawTarget;                                  /**< Internal auto-calibration target in percentage for CSX widgets
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
        uint8_t intrIsxRawTarget;                                  /**< Internal auto-calibration target in percentage for ISX widgets
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;
                                                                    */
        uint8_t intrWbxRawTarget;                                  /**< Internal auto-calibration target in percentage for WBX widgets
                                                                    * \note This field is available only for the fifth-generation and for the fifth-generation low power CAPSENSE&trade;
                                                                    */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            uint8_t numSenseMethod;                                /**< The number of sense methods, used in the project
                                                                    * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                    */
            uint8_t mapSenseMethod[CY_CAPSENSE_REG_MODE_NUMBER];   /**< The map array of sense methods, used in the project
                                                                    * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                    */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            uint8_t csdCdacDitherEn;                               /**< Enabled CDAC dithering for CSD sensing method
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t csxCdacDitherEn;                               /**< Enabled CDAC dithering for CSX sensing method
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t isxCdacDitherEn;                               /**< Enabled CDAC dithering for ISX sensing method
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t bslnCoefSlow;                                  /**< Baseline IIR filter coefficient (slow) for Low power widget.
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t bslnCoefFast;                                  /**< Baseline IIR filter coefficient (fast) for Low power widget.
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t bslnUpdateDelay;                               /**< Specifies the value from which timer is decremented from on consecutive scans where the baseline update IIR produces a zero.
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t iirCoeffLp;                                    /**< Rawcount IIR filter coefficient for Low power widget
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */

