zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
            uint8_t firstActSubFrame;                              /**< The flag for a first Active sub-frame. It is used for Active Low Refresh-rate scans
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t numFunc;                                       /**< The number of pin functions, used in the project
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t mapPinState[CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER]; /**< The map array of CTRLMUX pin functions, used in the project
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t operatingMode;                                 /**< The internal fifth-generation low power CAPSENSE&trade; HW block operating mode
                                                                    * * 0 - CY_CAPSENSE_CTL_OPERATING_MODE_CPU
                                                                    * * 2 - CY_CAPSENSE_CTL_OPERATING_MODE_AS_MS
                                                                    * * 3 - CY_CAPSENSE_CTL_OPERATING_MODE_LP_AOS
                                                                    * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                    */
            uint8_t mrssStateAfterScan;                            /**< Defines the MRSS state after scan frame is complete. By default MRSS is left enabled */
            uint8_t repeatScanEn;                                  /**< Defines if repeating the previous scan is allowed for the RepeatScan() function usage */
        #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */

    #if (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        en_hsiom_sel_t csxInactiveSnsHsiom;                        /**< Internal pre-calculated data for faster operation */
        en_hsiom_sel_t csdInactiveSnsHsiom;                        /**< Internal pre-calculated data for faster operation */
    #endif /* (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    uint8_t intrCsdInactSnsConn;                                   /**< Internal inactive electrode connection for CSD scan:
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_SHIELD
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_GROUND */
    uint8_t intrCsxInactSnsConn;                                   /**< Internal inactive electrode connection for CSX scan:
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_HIGHZ
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_GROUND
                                                                    * * CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 */
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && (0u != CY_CAPSENSE_RC_HW_IIR_FILTER_EN))
        uint8_t hwIirInit;                                         /**< Flag to reset/initialize HW IIR filter for active widgets during calibration, first scan, etc. */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && (0u != CY_CAPSENSE_RC_HW_IIR_FILTER_EN)) */
}cy_stc_capsense_internal_context_t;


/** Declares the structure that is intended to store the \ref cy_stc_capsense_widget_context_t
 *  data structure fields, the CRC checking should be applied for.
 */
typedef struct
{
    uint16_t fingerThVal;                                       /**< The value of the .fingerTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t proxThVal;                                         /**< The value of the .proxTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t fingerCapVal;                                      /**< The value of the .fingerCap field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t sigPFCVal;                                         /**< The value of the .sigPFC field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t resolutionVal;                                     /**< The value of the .resolution field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t lowBslnRstVal;                                     /**< The value of the .lowBslnRst field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t snsClkVal;                                         /**< The value of the .snsClk field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t rowSnsClkVal;                                      /**< The value of the .rowSnsClk field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t noiseThVal;                                        /**< The value of the .noiseTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t nNoiseThVal;                                       /**< The value of the .nNoiseTh field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t hysteresisVal;                                     /**< The value of the .hysteresis field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t maxRawCountVal;                                    /**< The value of the .maxRawCount field of the \ref cy_stc_capsense_widget_context_t structure */
    uint16_t maxRawCountRowVal;                                 /**< The value of the .maxRawCountRow field of the \ref cy_stc_capsense_widget_context_t structure */
    uint8_t onDebounceVal;                                      /**< The value of the .onDebounce field of the \ref cy_stc_capsense_widget_context_t structure */
    uint8_t snsClkSourceVal;                                    /**< The value of the .snsClkSource field of the \ref cy_stc_capsense_widget_context_t structure */
    uint8_t bslnCoeffVal;                                       /**< The value of the .bslnCoeff field of the \ref cy_stc_capsense_widget_context_t structure */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t idacModVal[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];     /**< The value of the .idacMod field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t idacGainIndexVal;                                   /**< The value of the .idacGainIndex field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t rowIdacModVal[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM];  /**< The value of the .rowIdacMod field of the \ref cy_stc_capsense_widget_context_t structure */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint8_t cdacDitherEnVal;                                    /**< The value of the .cdacDitherEn field of the \ref cy_stc_capsense_widget_context_t structure */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint8_t cicShiftVal;                                        /**< The value of the .cicShift field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t rowCicShiftVal;                                     /**< The value of the .rowCicShift field of the \ref cy_stc_capsense_widget_context_t structure */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

