zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && \
         ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN)))
        uint8_t cdacFineVal;                                        /**< The value of the .cdacFine field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t rowCdacFineVal;                                     /**< The value of the .rowCdacFine field of the \ref cy_stc_capsense_widget_context_t structure */
    #endif

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint16_t cdacCompDividerVal;                                /**< The value of the .cdacCompDivider field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t cdacRefVal;                                         /**< The value of the .cdacRef field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t rowCdacRefVal;                                      /**< The value of the .rowCdacRef field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t cicRateVal;                                         /**< The value of the .cicRate field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t lfsrBitsVal;                                        /**< The value of the .lfsrBits field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t cdacDitherValueVal;                                 /**< The value of the .cdacDitherValue field of the \ref cy_stc_capsense_widget_context_t structure */
        uint8_t coarseInitBypassEnVal;                              /**< The value of the .coarseInitBypassEn field of the \ref cy_stc_capsense_widget_context_t structure */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    #if (CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN)
        uint16_t liquidPresenceLevel2Val;                           /**< The value of the .liquidPresenceLevel2 field of the \ref cy_stc_capsense_widget_context_t structure */
        uint16_t liquidPresenceLevel3Val;                           /**< The value of the .liquidPresenceLevel3 field of the \ref cy_stc_capsense_widget_context_t structure */
    #endif /* (CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN) */
}cy_stc_capsense_widget_crc_data_t;
/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_structures *//** \{ */
/******************************************************************************/

/** Declares top-level Context Data Structure */
typedef struct
{
    uint16_t configId;                                          /**< 16-bit CRC calculated by the CAPSENSE&trade; Configurator tool for the CAPSENSE&trade; configuration.
                                                                   * Used by the CAPSENSE&trade; Tuner tool to identify if the FW corresponds to the specific user configuration. */
    uint16_t tunerCmd;                                          /**< Tuner Command Register \ref cy_en_capsense_tuner_cmd_t.
                                                                  * Used for the communication between the CAPSENSE&trade; Tuner tool and the middleware */
    uint8_t mwVersionMajor;                                     /**< Specifies MW major version */
    uint8_t mwVersionMinor;                                     /**< Specifies MW minor version */
    uint16_t scanCounter;                                       /**< This counter increments after each scan of active widgets. */
    uint8_t tunerSt;                                            /**< State of CAPSENSE&trade; middleware tuner module. \ref cy_en_capsense_tuner_state_t */
    uint8_t initDone;                                           /**< Keep information whether initialization was done or not */
    uint16_t misc;                                              /**< Specifies miscellaneous feature configuration (internal usage):
                                                                  * * Bit[0-5] - Widget ID
                                                                  */
    volatile uint32_t status;                                   /**< Middleware status information:
                                                                  * * Bit[0-3] - The set [x] bit of the result means that the previously initiated scan for the [x] channel is in progress.
                                                                  *              For MSCv3 each bit shows a busyness of a corresponding sensing channel. 
                                                                  *              The next scan frame cannot be started (CY_CAPSENSE_BUSY_ALL_CH_MASK)
                                                                  * * Bit[4] - The last or currently scanned widget type is Active widget (CY_CAPSENSE_MW_STATE_ACTIVE_WD_SCAN_MASK)
                                                                  * * Bit[5] - The last or currently scanned widget type is Low Power widget (CY_CAPSENSE_MW_STATE_LP_WD_SCAN_MASK)
                                                                  * * Bit[6] - Reserved
                                                                  * * Bit[7] - The previously initiated scan is in progress (CY_CAPSENSE_BUSY)
                                                                  * * Bit[8] - Reserved
                                                                  * * Bit[9] - Reserved
                                                                  * * Bit[10] - A touch is detected on any low power widget. 
                                                                  *             The bit is automatically cleared when a new low power scan triggered (CY_CAPSENSE_MW_STATE_LP_ACTIVE_MASK)
                                                                  * * Bit[11] - CapSense Middleware performs BIST functionality which might include multiple HW scanning 
                                                                  *             and result processing (CY_CAPSENSE_MW_STATE_BIST_MASK)
                                                                  * * Bit[12] - The auto-calibration in Single CDAC mode (CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK)
                                                                  * * Bit[13] - The auto-calibration is in progress. The next scan frame cannot be started (CY_CAPSENSE_MW_STATE_CALIBRATION_MASK)
                                                                  * * Bit[14] - The smart sensing algorithm is in progress. The next scan frame cannot be started (CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK)
                                                                  * * Bit[15] - Middleware initialization is in progress and the next 
                                                                  *             scan frame cannot be initiated (CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK)
                                                                  * * Bit[16-31] - The set [x] number of the result means that the previously initiated
                                                                  *                scan for the [x] slot is completed or in progress. In CS-DMA mode, this field is set only for the first
                                                                  *                scanned slot (CY_CAPSENSE_MW_STATE_SCAN_SLOT_MASK[x])
                                                                  * \note For the the forth-generation CAPSENSE&trade; only Bit[7] is available.
                                                                  */
    uint32_t timestampInterval;                                 /**< Timestamp interval used at increasing the timestamp by Cy_CapSense_IncrementGestureTimestamp() */
    uint32_t timestamp;                                         /**< Current timestamp should be kept updated and operational, which is vital for the
                                                                   * operation of Gesture and Ballistic multiplier features */
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        uint8_t modCsdClk;                                      /**< The modulator clock divider for the CSD widgets
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
        uint8_t modCsxClk;                                      /**< The modulator clock divider for the CSX widgets
                                                                 * \note This field is available only for the fourth-generation CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

    uint8_t tunerCnt;                                           /**< Command counter of CAPSENSE&trade; middleware tuner module */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint16_t cdacTrimCoefficient;                            /**< CDAC trimming coefficient.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
        uint16_t lpDataSt;                                       /**< State of Low Power data processing:
                                                                  * * Bit[0] = 0 (Default) - data is not copied and cannot be transmitted to Tuner
                                                                  * * Bit[0] = 1 - data copied by CAPSENSE&trade; and transmitted to Tuner.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
        uint8_t lpFirstSnsId;                                    /**< The first scanned low power sensor within LP frame.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
        uint8_t lpSnsNumber;                                     /**< The number of consecutive scanned low power sensors from the .lpFirstSnsID.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
        uint8_t lpNumFrame;                                      /**< The number of fully scanned low power frames available in the packet.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
        uint8_t lpScanCounter;                                   /**< This counter increments after each scan of low power widgets.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
        uint8_t lpScanSt;                                            /**< The state / status of low power sensor baselines:
                                                                  * * Bit[0] = 0 - baseline reset: does not happen
                                                                  * * Bit[0] = 1 - baseline reset: happen
                                                                  * * Bit[1] = 0 - baseline is not valid due to FIFO overflow
                                                                  * * Bit[1] = 1 - baseline is valid.
                                                                  * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                  */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

} cy_stc_capsense_common_context_t;


#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    /** Declares historic rawcount low power sensors */
    typedef uint16_t cy_stc_capsense_lp_historic_context_t;
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */


/** Declares top-level CAPSENSE&trade; context data structure */
typedef struct
{
    const cy_stc_capsense_common_config_t * ptrCommonConfig;    /**< Pointer to the common configuration structure */
    cy_stc_capsense_common_context_t * ptrCommonContext;        /**< Pointer to the common context structure */
    cy_stc_capsense_internal_context_t * ptrInternalContext;    /**< Pointer to the internal context structure */
    const cy_stc_capsense_widget_config_t * ptrWdConfig;        /**< Pointer to the widget configuration structure */
    cy_stc_capsense_widget_context_t * ptrWdContext;            /**< Pointer to the widget context structure */
    const cy_stc_capsense_pin_config_t * ptrPinConfig;          /**< Pointer to the pin configuration structure */
    const cy_stc_capsense_pin_config_t * ptrShieldPinConfig;    /**< Pointer to the shield pin configuration structure */
    cy_stc_capsense_active_scan_sns_t * ptrActiveScanSns;       /**< Pointer to the current active sensor structure */
    cy_stc_capsense_bist_context_t * ptrBistContext;            /**< Pointer to the BIST context structure */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        cy_stc_msc_base_config_t * ptrBaseFrameContext;         /**< Pointer to the first member of the context structure of base configuration array
                                                                 * \note This field is available only for the fifth-generation CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        cy_stc_msclp_base_config_t * ptrBaseFrameContext;       /**< Pointer to the first member of the context structure of base configuration array
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

