zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        uint32_t * ptrSensorFrameContext;                       /**< Pointer to the context structure of sensor configuration
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        uint32_t * ptrSensorFrameLpContext;                     /**< Pointer to the context structure of low power sensor configuration
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        const cy_stc_capsense_scan_slot_t * ptrScanSlots;       /**< Pointer to the scan order slot structure
                                                                 * \note This field is available for the fifth-generation CAPSENSE&trade; and fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        const cy_stc_capsense_scan_slot_t * ptrLpScanSlots;     /**< Pointer to the low power scan order slot structure
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        cy_stc_capsense_lp_historic_context_t * ptrLpHistoricContext;
                                                                /**< Pointer to the low power historic data
                                                                 * \note This field is available only for the fifth-generation low power CAPSENSE&trade;.
                                                                 */
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */


    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
        const cy_stc_capsense_pin_config_t * ptrExtCrefPinConfig;  /**< Pointer to the External Cref pin configuration array.
                                                                    * \note This field is available only for the fifth-generation
                                                                    * CAPSENSE&trade; PSOC&trade; 4 HVMS devices.
                                                                    */
    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
} cy_stc_capsense_context_t;

/** \} */


/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_high_level *//** \{ */
/******************************************************************************/

uint32_t Cy_CapSense_IsAnyWidgetActive(const cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    uint32_t Cy_CapSense_IsAnyLpWidgetActive(const cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

uint32_t Cy_CapSense_IsWidgetActive(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_IsSensorActive(
                uint32_t widgetId,
                uint32_t sensorId,
                const cy_stc_capsense_context_t * context);
#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_PROXIMITY_EN)
    uint32_t Cy_CapSense_IsProximitySensorActive(
                    uint32_t widgetId,
                    uint32_t sensorId,
                    const cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_PROXIMITY_EN) */
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TOUCHPAD_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MATRIX_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SLIDER_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN))
    cy_stc_capsense_touch_t * Cy_CapSense_GetTouchInfo(
                    uint32_t widgetId,
                    const cy_stc_capsense_context_t * context);
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TOUCHPAD_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MATRIX_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SLIDER_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN)) */
#if (CY_CAPSENSE_LIQUID_LEVEL_EN)
    uint16_t Cy_CapSense_GetLiquidWidgetPosition(
                    uint32_t widgetId,
                    const cy_stc_capsense_context_t * context);
    uint32_t Cy_CapSense_GetLiquidPresenceLevel(
                    uint32_t widgetId,
                    const cy_stc_capsense_context_t * context);
    #if (CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
        uint16_t Cy_CapSense_GetFoamWidgetPosition(
                        uint32_t widgetId,
                        const cy_stc_capsense_context_t * context);
    #endif /* (CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN) */
#endif /* (CY_CAPSENSE_LIQUID_LEVEL_EN) */
/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_low_level *//** \{ */
/******************************************************************************/

cy_capsense_status_t Cy_CapSense_GetParam(
                uint32_t paramId,
                uint32_t * value,
                const void * ptrTuner,
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_SetParam(
                uint32_t paramId,
                uint32_t value,
                void * ptrTuner,
                cy_stc_capsense_context_t * context);
uint16_t Cy_CapSense_GetCRC(
                const uint8_t *ptrData,
                uint32_t len);
cy_capsense_status_t Cy_CapSense_SetWidgetStatus(
                uint32_t widgetId,
                uint32_t mode,
                uint32_t value,
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_IsWidgetEnabled(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context);
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    uint32_t Cy_CapSense_IsSlotEnabled(
                    uint32_t slotId,
                    const cy_stc_capsense_context_t * context);
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */
#if (CY_CAPSENSE_LIQUID_LEVEL_TANK_REMOVAL_DETECTION_EN)
uint8_t Cy_CapSense_IsTankRemoved(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#endif

