zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.h
uint8_t Cy_Capsense_GetFingerType(cy_stc_capsense_context_t * context, uint32_t widgetId);

/** \} */


/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

cy_capsense_status_t Cy_CapSense_CheckConfigIntegrity(
                const cy_stc_capsense_context_t * context);
uint16_t Cy_CapSense_GetCrcWidget(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    void Cy_CapSense_SetSnsFrameValidity(
                    uint32_t widgetId,
                    cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

/** This enumeration is obsolete and should not be used further.
 * Instead some of the following macros with the _GROUP suffix should be used:
 * \ref group_capsense_macros_settings.
 */
typedef enum
{
    CY_CAPSENSE_UNDEFINED_E             = 0x00u,                /**< Undefined method used at initialization */
    CY_CAPSENSE_SENSE_METHOD_CSD_E      = 0x01u,                /**< CSD sensing method */
    CY_CAPSENSE_SENSE_METHOD_CSX_E      = 0x02u,                /**< CSX sensing method */
    CY_CAPSENSE_SENSE_METHOD_BIST_E     = 0x03u,                /**< BIST sensing method */
} cy_en_capsense_sensing_method_t;


/** This structure is obsolete and should not be used further.
 * Instead cy_stc_capsense_active_scan_sns_t should be used.
 */
#define cy_stc_active_scan_sns_t        cy_stc_capsense_active_scan_sns_t


/** \} \endcond */


#if defined(__cplusplus)
}
#endif /* defined(__cplusplus) */

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */

#endif /* CY_CAPSENSE_STRUCTURE_H */


/* [] END OF FILE */
